In [1]:
Cars={"company":("Toyota","Landrover","Mahindra","Tata","Morris garage","Suzuki","Benz","BMW","Force","Hyundai"),"cars":("Landcruiser","Defender","Thar","Harrier","Hector","Brezza","Gwagon","X8","Gurkha","Verna")}
print(Cars)

{'company': ('Toyota', 'Landrover', 'Mahindra', 'Tata', 'Morris garage', 'Suzuki', 'Benz', 'BMW', 'Force', 'Hyundai'), 'cars': ('Landcruiser', 'Defender', 'Thar', 'Harrier', 'Hector', 'Brezza', 'Gwagon', 'X8', 'Gurkha', 'Verna')}

In [2]:
import pandas
import pandas as pd
df=pd.DataFrame(Cars)
df

         company         cars
0         Toyota  Landcruiser
1      Landrover     Defender
2       Mahindra         Thar
3           Tata      Harrier
4  Morris garage       Hector
5         Suzuki       Brezza
6           Benz       Gwagon
7            BMW           X8
8          Force       Gurkha
9        Hyundai        Verna

In [5]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [6]:
df.head()

         company         cars
0         Toyota  Landcruiser
1      Landrover     Defender
2       Mahindra         Thar
3           Tata      Harrier
4  Morris garage       Hector

In [7]:
df.tail()

   company    cars
5   Suzuki  Brezza
6     Benz  Gwagon
7      BMW      X8
8    Force  Gurkha
9  Hyundai   Verna

In [8]:
df.columns

Index(['company', 'cars'], dtype='object')

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   company  10 non-null     object
 1   cars     10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

In [10]:
df.iloc[0:]

         company         cars
0         Toyota  Landcruiser
1      Landrover     Defender
2       Mahindra         Thar
3           Tata      Harrier
4  Morris garage       Hector
5         Suzuki       Brezza
6           Benz       Gwagon
7            BMW           X8
8          Force       Gurkha
9        Hyundai        Verna

In [11]:
df.iloc[:8]

         company         cars
0         Toyota  Landcruiser
1      Landrover     Defender
2       Mahindra         Thar
3           Tata      Harrier
4  Morris garage       Hector
5         Suzuki       Brezza
6           Benz       Gwagon
7            BMW           X8

In [13]:
df['company'].unique()

array(['Toyota', 'Landrover', 'Mahindra', 'Tata', 'Morris garage',
       'Suzuki', 'Benz', 'BMW', 'Force', 'Hyundai'], dtype=object)

In [14]:
df.dtypes

company    object
cars       object
dtype: object

In [15]:
type(df)

pandas.core.frame.DataFrame